export const LINE_DEFS = [
  { id: "HIGASHIYAMA", name: "東山線" },
  { id: "MEIJO", name: "名城線" },
  { id: "MEIKO", name: "名港線" },
  { id: "TSURUMAI", name: "鶴舞線" },
  { id: "SAKURADORI", name: "桜通線" },
];

export const LINE_STATIONS = {
  HIGASHIYAMA: [
    "高畑","八田","岩塚","中村公園","中村日赤","本陣","亀島","名古屋","伏見","栄","新栄町","千種","今池","池下","覚王山","本山","東山公園","星ヶ丘","一社","上社","本郷","藤が丘"
  ],
  MEIJO: [
    "金山","東別院","上前津","矢場町","栄","久屋大通","名古屋城","名城公園","黒川","志賀本通","平安通","上飯田","大曽根","ナゴヤドーム前矢田","砂田橋","茶屋ヶ坂","自由ヶ丘","本山","名古屋大学","八事日赤","八事","総合リハビリセンター","瑞穂運動場東","新瑞橋","妙音通","堀田","熱田神宮伝馬町","熱田神宮西","西高蔵","金山"
  ],
  MEIKO: [
    "金山","日比野","六番町","東海通","港区役所","築地口","名古屋港"
  ],
  TSURUMAI: [
    "上小田井","庄内緑地公園","庄内通","浄心","浅間町","丸の内","伏見","大須観音","上前津","鶴舞","荒畑","御器所","川名","いりなか","八事","塩釜口","植田","原","平針","赤池"
  ],
  SAKURADORI: [
    "太閤通","名古屋","国際センター","丸の内","久屋大通","高岳","車道","今池","吹上","御器所","桜山","瑞穂区役所","瑞穂運動場西","新瑞橋","桜本町","鶴里","野並","鳴子北","相生山","神沢","徳重"
  ],
};
